cases/case04_chiller/0/gas/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| Gas-region turbulent thermal diffusivity. Computed by the wall function;    |
| present here so chtMultiRegionFoam picks up the field on every patch.      |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/gas";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ".*"
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
}

// ************************************************************************* //
