cases/case04_chiller/0/gas/k
/*--------------------------------*- C++ -*----------------------------------*\
| Gas-region turbulent kinetic energy.                                        |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/gas";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-3;

boundaryField
{
    ".*"
    {
        type            kqRWallFunction;
        value           uniform 1e-3;
    }
}

// ************************************************************************* //
