cases/case04_chiller/0/gas/nut
/*--------------------------------*- C++ -*----------------------------------*\
| Gas-region turbulent viscosity (computed by the model; wall function on    |
| solid boundaries).                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/gas";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ".*"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}

// ************************************************************************* //
