cases/case04_chiller/0/gas/omega
/*--------------------------------*- C++ -*----------------------------------*\
| Gas-region specific dissipation rate (k-ω SST).                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/gas";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{
    ".*"
    {
        type            omegaWallFunction;
        value           uniform 1.0;
    }
}

// ************************************************************************* //
