cases/case04_chiller/0/liquid/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| Liquid-region turbulent thermal diffusivity.                                |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/liquid";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    liquid_inlet
    {
        type            calculated;
        value           uniform 0;
    }
    liquid_outlet
    {
        type            calculated;
        value           uniform 0;
    }
    ".*"
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
}

// ************************************************************************* //
