cases/case04_chiller/0/liquid/k
/*--------------------------------*- C++ -*----------------------------------*\
| Liquid-region turbulent kinetic energy.                                     |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/liquid";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-4;

boundaryField
{
    liquid_inlet
    {
        type            fixedValue;
        value           uniform 1e-4;
    }
    liquid_outlet
    {
        type            zeroGradient;
    }
    ".*"
    {
        type            kqRWallFunction;
        value           uniform 1e-4;
    }
}

// ************************************************************************* //
