cases/case04_chiller/0/liquid/nut
/*--------------------------------*- C++ -*----------------------------------*\
| Liquid-region turbulent viscosity.                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/liquid";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    liquid_inlet
    {
        type            calculated;
        value           uniform 0;
    }
    liquid_outlet
    {
        type            calculated;
        value           uniform 0;
    }
    ".*"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}

// ************************************************************************* //
