cases/case04_chiller/0/liquid/omega
/*--------------------------------*- C++ -*----------------------------------*\
| Liquid-region specific dissipation rate (k-ω SST).                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/liquid";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{
    liquid_inlet
    {
        type            fixedValue;
        value           uniform 1.0;
    }
    liquid_outlet
    {
        type            zeroGradient;
    }
    ".*"
    {
        type            omegaWallFunction;
        value           uniform 1.0;
    }
}

// ************************************************************************* //
