cases/case04_chiller/0/liquid/p
/*--------------------------------*- C++ -*----------------------------------*\
| Liquid-region pressure (low-pressure cooling-water side; ~1 atm).           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/liquid";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.013e5;

boundaryField
{
    ".*"
    {
        type            calculated;
        value           uniform 1.013e5;
    }
}

// ************************************************************************* //
