cases/case04_chiller/0/liquid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| Liquid-region hydrostatic pressure.                                         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/liquid";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.013e5;

boundaryField
{
    liquid_inlet
    {
        type            fixedFluxPressure;
        value           uniform 1.013e5;
    }
    liquid_outlet
    {
        type            fixedValue;
        value           uniform 1.013e5;
    }
    ".*"
    {
        type            fixedFluxPressure;
        value           uniform 1.013e5;
    }
}

// ************************************************************************* //
