cases/case04_chiller/constant/gas/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| sCO₂ thermophysical properties for the gas region of case04_chiller.        |
|                                                                             |
| ⚠ PLACEHOLDER. Same caveat as cases/case01_straight_channel/constant/       |
|   thermophysicalProperties: the perfectGas + hConst block below is wrong    |
|   for sCO₂ near the pseudo-critical line and must be replaced before any   |
|   production run with a tabulated lookup generated by                       |
|     `python3 src/tools/export_lut.py --output-prefix sco2_lut`              |
|   (see docs/02_phase2_cfd_rom.md § 2.3 Method A) or a custom heRhoThermo    |
|   class (Method B). Wright2010 SAND2010-0171 § 3 lists chiller gas-side    |
|   inlet at ≈ 50 °C / 7.7 MPa where Cp(CO₂) varies by an order of magnitude  |
|   over a 5 K window — a constant Cp is unsuitable.                          |
|                                                                             |
| Tracking: docs/known_gaps.md#pche-geometry.                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/gas";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;     // PLACEHOLDER — replace with sCO2 LUT
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   44.01;          // g/mol — CO2
    }
    thermodynamics
    {
        Cp          5000;           // J/kg·K — illustrative; sCO2 Cp varies wildly
        Hf          0;
    }
    transport
    {
        mu          3e-5;           // Pa·s   — placeholder
        Pr          1.0;            // Prandtl placeholder
    }
}

// ************************************************************************* //
