cases/case04_chiller/constant/regionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| regionProperties — multi-region driver for chtMultiRegionFoam.              |
|                                                                             |
| STATUS: LIVE. Allrun calls splitMeshRegions -cellZones -overwrite after     |
| snappyHexMesh, which reads this file to discover the regions to write       |
| (gas + liquid). The tube-interior cellZone (`gas_zone` per                  |
| system/snappyHexMeshDict refinementSurfaces.tube_wall.cellZone) becomes     |
| the `gas` region; the remaining shell-side cells become the `liquid`       |
| region. chtMultiRegionFoam then time-steps both in lockstep, coupled at    |
| the tube_wall_gas / tube_wall_liquid regionCoupling patches via            |
| compressible::turbulentTemperatureCoupledBaffleMixed (see                  |
| 0/{gas,liquid}/T).                                                          |
|                                                                             |
| Not yet validated in an OpenFOAM environment — see                          |
| cases/case04_chiller/README.md "Validation status".                         |
|                                                                             |
| Reference:                                                                  |
|   docs/known_gaps.md#pche-geometry                                          |
|   docs/02_phase2_cfd_rom.md § 2.5                                           |
|   OpenFOAM tutorial: heatTransfer/chtMultiRegionFoam/multiRegionHeater      |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      regionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

regions
(
    // Inside the helical tube — supercritical CO2 (high pressure, hot side).
    // Created by splitMeshRegions from the `gas_zone` cellZone tagged by
    // snappyHexMeshDict refinementSurfaces.tube_wall.{cellZone, cellZoneInside}.
    fluid       (gas liquid)

    // No solid region in the chiller scaffold yet. The tube wall is treated
    // as a thermal-interface patch (regionCoupling) between gas and liquid
    // rather than meshed as a separate solid. Promote tube_wall to a thin
    // solid region only if axial conduction along the tube wall turns out
    // to be a finding — Wright2010 § 3 uses thin-wall assumption.
    solid       ()
);

// ************************************************************************* //
