cases/case04_chiller/system/gas/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| Discretisation schemes for the gas region (sCO₂ / supercritical CO2).       |
| chtMultiRegionFoam reads system/gas/fvSchemes for cells inside the helical  |
| tube. Identical structure to case01's single-region buoyantPimpleFoam       |
| schemes — sCO₂ near the pseudo-critical line is sensitive to upwinding;    |
| linearUpwind on momentum/energy keeps stability without smearing.          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/gas";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                          none;
    div(phi,U)                       Gauss linearUpwindV grad(U);
    div(phi,K)                       Gauss linear;
    div(phi,h)                       Gauss linearUpwind default;
    div(phi,k)                       Gauss upwind;
    div(phi,omega)                   Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
