cases/case04_chiller/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| snappyHexMesh: cut the helical tube + shell out of the background mesh.     |
| Requires the two STLs produced by                                           |
|   `python -m tools.cad.helical_coil`                                        |
| under `constant/triSurface/`:                                               |
|   helical_tube.stl   — gas-side tube outer wall (38.1 mm OD)                |
|   chiller_shell.stl  — coaxial shell outer cylinder                         |
| and the two .eMesh feature files produced by `surfaceFeatureExtract`        |
| (see system/surfaceFeatureExtractDict).                                     |
|                                                                             |
| Reference: docs/02_phase2_cfd_rom.md § 2.5 +                                |
|            docs/data_extracts/wright2010_sand2010-0171.md "Table 3.2".      |
|                                                                             |
| Refinement: production grade — tube_wall (3 4), shell_wall (2 3).           |
| Surface layers active on the tube wall (boundary-layer resolution on the    |
| heat-transfer surface). Smoke-test runs can drop layers via Allrun env.     |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    helical_tube.stl
    {
        type triSurfaceMesh;
        name tube_wall;
    }
    chiller_shell.stl
    {
        type triSurfaceMesh;
        name shell_wall;
    }
}

castellatedMeshControls
{
    maxLocalCells       4000000;
    maxGlobalCells      16000000;
    minRefinementCells  10;
    nCellsBetweenLevels 3;
    resolveFeatureAngle 30;
    features
    (
        {
            file   "helical_tube.eMesh";
            level  4;
        }
        {
            file   "chiller_shell.eMesh";
            level  2;
        }
    );
    refinementSurfaces
    {
        tube_wall
        {
            // Production: (3 4) — captures the gas/liquid interface curvature
            // and matches the dominant heat-transfer surface. Smoke-test
            // runs may drop to (2 3) if memory-constrained.
            //
            // faceZone + cellZone tags are required by splitMeshRegions:
            //   faceZone tube_wall  → kept as the regionCoupling boundary
            //                         between the gas and liquid regions
            //                         after splitMeshRegions -cellZones.
            //   cellZone gas_zone   → cells inside the helical tube; the
            //                         tube interior becomes the `gas`
            //                         region after split. Cells outside
            //                         the tube remain in the default
            //                         (unzoned) domain, which split
            //                         renames `liquid`.
            //   cellZoneInside inside → STL is closed → cells enclosed by
            //                         helical_tube.stl are tagged.
            level         (3 4);
            faceZone      tube_wall;
            cellZone      gas_zone;
            cellZoneInside inside;
            patchInfo     { type wall; }
        }
        shell_wall
        {
            // Shell is a straight cylinder; (2 3) is enough to keep the
            // outer wall well-resolved without bloating cell count.
            level (2 3);
            patchInfo { type wall; }
        }
    }
    refinementRegions
    {
        tube_wall
        {
            // Refine cells inside the helical tube (gas / sCO₂ side) to
            // match the gas-region snap level. Without this block the
            // tube interior keeps the coarse background resolution and
            // the gas-side flow domain is under-resolved.
            mode  inside;
            levels ((1e15 3));
        }
    }
    // The gas/liquid split needs TWO insidePoints — one per cellZone — so
    // that splitMeshRegions can label them. Until splitMeshRegions runs
    // the mesh is single-region and only the first locationInMesh is
    // honoured by snappyHexMesh; the second is a forward-compatible hint
    // for tools that read locationsInMesh (OpenFOAM ≥ 6).
    //
    // (0.220, 0, 0.760)  — shell-side annulus at mid-height (liquid).
    // (0.200, 0, 0.025)  — sits inside the tube at the first turn (gas);
    //                      tube axis traces |x|=200 mm in the (x, z) plane
    //                      at z = pitch/4 = 25 mm.
    locationInMesh   (0.220 0.0 0.760);
    locationsInMesh
    (
        ((0.220 0.0 0.760) liquid)
        ((0.200 0.0 0.025) gas)
    );
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch         3;
    tolerance            2.0;
    nSolveIter           50;
    nRelaxIter           5;
    nFeatureSnapIter     15;
    implicitFeatureSnap  false;
    explicitFeatureSnap  true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes        true;
    layers
    {
        tube_wall { nSurfaceLayers 5; }
        shell_wall { nSurfaceLayers 2; }
    }
    expansionRatio       1.2;
    finalLayerThickness  0.4;
    minThickness         0.05;
    nGrow                0;
    featureAngle         60;
    nRelaxIter           5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals       3;
    nSmoothThickness     10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle   90;
    nBufferCellsNoExtrude 0;
    nLayerIter           50;
}

meshQualityControls
{
    maxNonOrtho         65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave          80;
    minVol              1e-13;
    minTetQuality       1e-15;
    minArea             -1;
    minTwist            0.05;
    minDeterminant      0.001;
    minFaceWeight       0.05;
    minVolRatio         0.01;
    minTriangleTwist    -1;
    nSmoothScale        4;
    errorReduction      0.75;
}

mergeTolerance 1e-6;

// ************************************************************************* //
